blog/posts/post1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-11 Sun 20:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>coming back to life</title>
<meta name="author" content="likith" />
<meta name="description" content="a gradual return to posting online
footer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/styles/styles.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">coming back to life</h1>
<p>
If you had told me two years ago that, two years from then, I would be in Bangalore, doing primarily video-editing as a job, for my friend's financial advisory company, I'd probably laugh it off as completely insane. I have found myself in similar situations over the past decade or so, where my life at one point in time, would probably have been unrecognisable to me 2-4 years prior. For a big chunk of my life, I was barely in touch with what I really wanted to do, but I'm happy to say that that has gradually been getting further and further away from the truth.
</p>

<div id="outline-container-org6660e41" class="outline-2">
<h2 id="org6660e41">career</h2>
<div class="outline-text-2" id="text-org6660e41">
<p>
After spending five years learning the ins and outs of how atoms behave, what electrons do, and their implications thereof, I slowly came to a painful realisation towards the end: While I genuinely enjoyed certain aspects of it, I didn't really want to keep doing research for the rest of my career. I knew this beyond a shadow of doubt during my postdoc position for which I did DFT (<a href="https://sci-hub.se/10.1021/jp960669l">Density Functional Theory</a>) for a primarily experimental research group. Of course this pursuit itself taught me a lot of lessons that have come to be invaluable to me, as a person, and this is true for the topic too.
</p>

<p>
But I successfully pivoted towards data analytics and I did enjoy it a lot, and thought, for a second, that I had found my path. Working for Deloitte (for <a href="https://www.mtb.com/personal">M&amp;T Bank</a> as a client) was a lot of fun. It brought  the problem-solving aspect that I enjoyed during my <a href="https://scholar.google.com/citations?user=jrlwT9IAAAAJ&amp;hl=en">research</a> and combined that with a fast-paced, high-stakes environment with a supportive manager, and in this environment, I daresay I thrived.
</p>

<p>
All seemed well, until I decided to come back to Bangalore, and continue along the same career path. Things didn't work out as I expected, and the next thing I knew, I had been job hunting for about a year and a half. I had been learning video editing (using only <a href="https://ffmpeg.org/">ffmpeg</a> at the time, mind you) as a hobby. Cut to a couple of months later, and I was now primarily a video editor at <a href="https://www.instagram.com/getwizr/?hl=en">Wizr Wealth</a>, a company that I am proud to say my friend had started a few years ago. Some of the perks include:
</p>

<ul class="org-ul">
<li>I get to use whatever software I want for the work that I do. I get to use python, emacs, and linux itself, and it really does feel like home in a lot of ways (looking at you, <a href="https://mse.ufl.edu/people/name/nancy-ruzycki/">Dr. R</a>)</li>
<li>I get to use my camera on a regular basis, and I have gotten to learn lots of things about studios, lighting, etc.</li>
<li>I am not bound by rigid hierarchies and meaningless (to me) rules which is typical, but of course, not always true, in larger organisations (in my experience at least)</li>
<li>I get to code, but I don't really <i>have</i> to</li>
</ul>
</div>
</div>
</div>
</body>
</html>
